"""关卡数据类型"""
from typing import Dict
from dataclasses import dataclass
from enum import Enum
from WaveData.WaveDataType import 波次体验, 波次配置

class 难度类型(Enum):
    """难度类型"""
    简单 = "简单"
    普通 = "普通"
    困难 = "困难"
    很难 = "很难"
    极难 = "极难"

关卡体验配置限制: Dict[难度类型, Dict] = {
    难度类型.简单: {
        波次体验.轻松: (5,15),
        波次体验.一般: (5,15),
        波次体验.困难: (1,3),
        波次体验.地狱: (0,1),
        波次体验.Boss: (0, 0),
        "boss可能出现波次":[15,20],
        "我方城堡血量":100,
        "敌方城堡血量":200,
    },
    难度类型.普通: {
        波次体验.轻松: (6,12),
        波次体验.一般: (6,12),
        波次体验.困难: (3,6),
        波次体验.地狱: (0,1),
        波次体验.Boss: (0,1),
        "boss可能出现波次":[10,15],
        "我方城堡血量":100,
        "敌方城堡血量":250,
    },
    难度类型.困难: {
        波次体验.轻松: (6,8),
        波次体验.一般: (5,8),
        波次体验.困难: (5,8),
        波次体验.地狱: (1,1),
        波次体验.Boss: (0, 1),
        "boss可能出现波次":[10,15],
        "我方城堡血量":100,
        "敌方城堡血量":300,
    },
    难度类型.很难: {
        波次体验.轻松: (4,8),
        波次体验.一般: (6,10),
        波次体验.困难: (6,8),
        波次体验.地狱: (0,1),
        波次体验.Boss: (1, 1),
        "boss可能出现波次":[5,10,15,20],
        "我方城堡血量":100,
        "敌方城堡血量":350,
    },
    难度类型.极难: {                            
        波次体验.轻松: (2,6),
        波次体验.一般: (6,10),
        波次体验.困难: (6,12),
        波次体验.地狱: (1,2),
        波次体验.Boss: (1, 1),
        "boss可能出现波次":[5,10,15,20],
        "我方城堡血量":100,
        "敌方城堡血量":400,
    }
}


@dataclass
class 关卡基础配置:
    """关卡基础配置"""
    关卡ID: int
    生成延迟时间: float             #秒
    难度类型: 难度类型
    我方城堡血量: int
    敌方城堡血量: int
    阵容强度: float
    绿色等级: int
    蓝色等级: int
    紫色等级: int
    波次配置: list[波次配置]
    限时生成时长: float = None 

@dataclass
class 关卡类型(Enum):
    """关卡类型"""
    支援城堡:str = "支援城堡"
    限时生存:str = "限时生存"
    
    


    
